bnahill/audiopulse-embedded/fw/FreescaleUSBv4.1.1/Source/Device/app/common/kinetis/MK40N512VMD100.h
/*! \} */ /* end of group LLWU_Register_Accessor_Macros */


/*! \} */ /* end of group LLWU_Peripheral */


/* ----------------------------------------------------------------------------
   -- LPTMR
   ---------------------------------------------------------------------------- */

/*! \addtogroup LPTMR_Peripheral LPTMR */
/*! \{ */

/*! LPTMR - Peripheral register structure */
typedef struct LPTMR_MemMap {
  uint32_t CSR;                                    /*!< Low Power Timer Control Status Register, offset: 0x0 */
  uint32_t PSR;                                    /*!< Low Power Timer Prescale Register, offset: 0x4 */
  uint32_t CMR;                                    /*!< Low Power Timer Compare Register, offset: 0x8 */
  uint32_t CNR;                                    /*!< Low Power Timer Counter Register, offset: 0xC */
} volatile *LPTMR_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- LPTMR - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup LPTMR_Register_Accessor_Macros LPTMR - Register accessor macros */
/*! \{ */


/* LPTMR - Register accessors */
#define LPTMR_CSR_REG(base)                      ((base)->CSR)
#define LPTMR_PSR_REG(base)                      ((base)->PSR)
#define LPTMR_CMR_REG(base)                      ((base)->CMR)
#define LPTMR_CNR_REG(base)                      ((base)->CNR)

/*! \} */ /* end of group LPTMR_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- LPTMR Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup LPTMR_Register_Masks LPTMR Register Masks */
/*! \{ */

/* CSR Bit Fields */
#define LPTMR_CSR_TEN_MASK                       0x1u
#define LPTMR_CSR_TEN_SHIFT                      0
#define LPTMR_CSR_TMS_MASK                       0x2u
#define LPTMR_CSR_TMS_SHIFT                      1
#define LPTMR_CSR_TFC_MASK                       0x4u
#define LPTMR_CSR_TFC_SHIFT                      2
#define LPTMR_CSR_TPP_MASK                       0x8u
#define LPTMR_CSR_TPP_SHIFT                      3
#define LPTMR_CSR_TPS_MASK                       0x30u
#define LPTMR_CSR_TPS_SHIFT                      4
#define LPTMR_CSR_TPS(x)                         (((uint32_t)(((uint32_t)(x))<<LPTMR_CSR_TPS_SHIFT))&LPTMR_CSR_TPS_MASK)
#define LPTMR_CSR_TIE_MASK                       0x40u
#define LPTMR_CSR_TIE_SHIFT                      6
#define LPTMR_CSR_TCF_MASK                       0x80u
#define LPTMR_CSR_TCF_SHIFT                      7
/* PSR Bit Fields */
#define LPTMR_PSR_PCS_MASK                       0x3u
#define LPTMR_PSR_PCS_SHIFT                      0
#define LPTMR_PSR_PCS(x)                         (((uint32_t)(((uint32_t)(x))<<LPTMR_PSR_PCS_SHIFT))&LPTMR_PSR_PCS_MASK)
#define LPTMR_PSR_PBYP_MASK                      0x4u
#define LPTMR_PSR_PBYP_SHIFT                     2
#define LPTMR_PSR_PRESCALE_MASK                  0x78u
#define LPTMR_PSR_PRESCALE_SHIFT                 3
#define LPTMR_PSR_PRESCALE(x)                    (((uint32_t)(((uint32_t)(x))<<LPTMR_PSR_PRESCALE_SHIFT))&LPTMR_PSR_PRESCALE_MASK)
/* CMR Bit Fields */
#define LPTMR_CMR_COMPARE_MASK                   0xFFFFu
#define LPTMR_CMR_COMPARE_SHIFT                  0
#define LPTMR_CMR_COMPARE(x)                     (((uint32_t)(((uint32_t)(x))<<LPTMR_CMR_COMPARE_SHIFT))&LPTMR_CMR_COMPARE_MASK)
/* CNR Bit Fields */
#define LPTMR_CNR_COUNTER_MASK                   0xFFFFu
#define LPTMR_CNR_COUNTER_SHIFT                  0
#define LPTMR_CNR_COUNTER(x)                     (((uint32_t)(((uint32_t)(x))<<LPTMR_CNR_COUNTER_SHIFT))&LPTMR_CNR_COUNTER_MASK)

/*! \} */ /* end of group LPTMR_Register_Masks */


/* LPTMR - Peripheral instance base addresses */
/*! Peripheral LPTMR0 base pointer */
#define LPTMR0_BASE_PTR                          ((LPTMR_MemMapPtr)0x40040000u)

/* ----------------------------------------------------------------------------
   -- LPTMR - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup LPTMR_Register_Accessor_Macros LPTMR - Register accessor macros */
/*! \{ */


/* LPTMR - Register instance definitions */
/* LPTMR0 */
#define LPTMR0_CSR                               LPTMR_CSR_REG(LPTMR0_BASE_PTR)
#define LPTMR0_PSR                               LPTMR_PSR_REG(LPTMR0_BASE_PTR)
#define LPTMR0_CMR                               LPTMR_CMR_REG(LPTMR0_BASE_PTR)
#define LPTMR0_CNR                               LPTMR_CNR_REG(LPTMR0_BASE_PTR)

/*! \} */ /* end of group LPTMR_Register_Accessor_Macros */


/*! \} */ /* end of group LPTMR_Peripheral */


/* ----------------------------------------------------------------------------
   -- MC
   ---------------------------------------------------------------------------- */

/*! \addtogroup MC_Peripheral MC */
/*! \{ */

/*! MC - Peripheral register structure */
typedef struct MC_MemMap {
  uint8_t SRSH;                                    /*!< System Reset Status Register High, offset: 0x0 */
  uint8_t SRSL;                                    /*!< System Reset Status Register Low, offset: 0x1 */
  uint8_t PMPROT;                                  /*!< Power Mode Protection Register, offset: 0x2 */
  uint8_t PMCTRL;                                  /*!< Power Mode Control Register, offset: 0x3 */
} volatile *MC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- MC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup MC_Register_Accessor_Macros MC - Register accessor macros */
/*! \{ */


/* MC - Register accessors */
#define MC_SRSH_REG(base)                        ((base)->SRSH)
#define MC_SRSL_REG(base)                        ((base)->SRSL)
#define MC_PMPROT_REG(base)                      ((base)->PMPROT)
#define MC_PMCTRL_REG(base)                      ((base)->PMCTRL)

/*! \} */ /* end of group MC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- MC Register Masks
   ---------------------------------------------------------------------------- */

